4.1

In [1]:
import numpy as np
import pandas as pd

mylist = list('abcdefghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

# 1. Series từ danh sách (list)
s_list = pd.Series(mylist)
print("Series từ list:")
print(s_list)

# 2. Series từ numpy array
s_array = pd.Series(myarr)
print("\nSeries từ numpy array:")
print(s_array)

# 3. Series từ dictionary
s_dict = pd.Series(mydict)
print("\nSeries từ dictionary:")
print(s_dict)

Series từ list:
0     a
1     b
2     c
3     d
4     e
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
dtype: object

Series từ numpy array:
0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
21    21
22    22
23    23
24    24
25    25
dtype: int64

Series từ dictionary:
a     0
b     1
c     2
d     3
e     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
v    21
w    22
x    23
y    24
z    25
dtype: int64

4.2

In [2]:
import numpy as np
import pandas as pd

mylist = list('abcdefghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

ser = pd.Series(mydict)

# Chuyển Series thành DataFrame và đưa index thành cột
df = ser.reset_index()
df.columns = ['index', 'value']

print(df)

   index  value
0      a      0
1      b      1
2      c      2
3      d      3
4      e      4
5      f      5
6      g      6
7      h      7
8      i      8
9      j      9
10     k     10
11     l     11
12     m     12
13     n     13
14     o     14
15     p     15
16     q     16
17     r     17
18     s     18
19     t     19
20     u     20
21     v     21
22     w     22
23     x     23
24     y     24
25     z     25

4.3

In [3]:
import numpy as np
import pandas as pd

ser1 = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

# Kết nối hai Series thành DataFrame
df = pd.concat([ser1, ser2], axis=1)
df.columns = ['col1', 'col2']

print(df)

   col1  col2
0     a     0
1     b     1
2     c     2
3     d     3
4     e     4
5     f     5
6     g     6
7     h     7
8     i     8
9     j     9
10    k    10
11    l    11
12    m    12
13    n    13
14    o    14
15    p    15
16    q    16
17    r    17
18    s    18
19    t    19
20    u    20
21    v    21
22    w    22
23    x    23
24    y    24
25    z    25

In [ ]:
4.4

In [4]:
import pandas as pd

ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

# 1. Từ ser1 xóa các mục có mặt trong ser2
result_1 = ser1[~ser1.isin(ser2)]
print("1. ser1 sau khi xóa các phần tử có trong ser2:")
print(result_1)

# 2. Lấy các mục có trong ser1 hoặc ser2 nhưng không nằm chung
result_2 = pd.Series(list(set(ser1) ^ set(ser2)))
print("\n2. Các phần tử chỉ xuất hiện ở một trong hai Series:")
print(result_2)

1. ser1 sau khi xóa các phần tử có trong ser2:
0    1
1    2
2    3
dtype: int64

2. Các phần tử chỉ xuất hiện ở một trong hai Series:
0    1
1    2
2    3
3    6
4    7
5    8
dtype: int64

4.5

In [5]:
import numpy as np
import pandas as pd

ser = pd.Series(np.random.normal(10, 5, 25))

# 1. Giá trị nhỏ nhất
min_val = ser.min()

# 2. Centile 25%
p25 = ser.quantile(0.25)

# 3. Trung vị
median_val = ser.median()

# 4. Centile 75%
p75 = ser.quantile(0.75)

# 5. Giá trị lớn nhất
max_val = ser.max()

print("Minimum:", min_val)
print("25th percentile:", p25)
print("Median:", median_val)
print("75th percentile:", p75)
print("Maximum:", max_val)

Minimum: -0.7745226154985296
25th percentile: 3.6475228151330654
Median: 8.597053102966289
75th percentile: 10.91022986558818
Maximum: 19.55263024149569

4.6

In [7]:
import numpy as np
import pandas as pd

ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

# Đếm số lần xuất hiện của mỗi giá trị
counts = ser.value_counts()

print("Series:")
print(ser)
print("\nSố lần xuất hiện của mỗi giá trị:")
print(counts)

Series:
0     h
1     g
2     h
3     a
4     f
5     d
6     f
7     a
8     e
9     f
10    b
11    h
12    f
13    d
14    f
15    h
16    b
17    b
18    c
19    a
20    a
21    c
22    e
23    e
24    e
25    h
26    f
27    c
28    f
29    d
dtype: object

Số lần xuất hiện của mỗi giá trị:
f    7
h    5
a    4
e    4
b    3
d    3
c    3
g    1
Name: count, dtype: int64

4.7

In [8]:
import numpy as np
import pandas as pd

np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

# Lấy 2 giá trị xuất hiện nhiều nhất
top2 = ser.value_counts().index[:2]

# Thay các giá trị khác bằng 'Other'
result = ser.where(ser.isin(top2), 'Other')

print("Series ban đầu:")
print(ser)
print("\nSeries sau khi xử lý:")
print(result)

Series ban đầu:
0     1
1     2
2     3
3     4
4     2
5     2
6     2
7     4
8     4
9     3
10    1
11    4
dtype: int32

Series sau khi xử lý:
0     Other
1         2
2     Other
3         4
4         2
5         2
6         2
7         4
8         4
9     Other
10    Other
11        4
dtype: object

4.8

In [9]:
import numpy as np
import pandas as pd

ser = pd.Series(np.random.random(20))

# Chia thành 10 phân vị và gán nhãn
labels = [f'Decile_{i+1}' for i in range(10)]
result = pd.qcut(ser, q=10, labels=labels)

print("Series ban đầu:")
print(ser)
print("\nSeries sau khi chia 10 phân vị:")
print(result)

Series ban đầu:
0     0.979853
1     0.831138
2     0.014711
3     0.290248
4     0.122564
5     0.029118
6     0.498853
7     0.627708
8     0.736350
9     0.140638
10    0.066320
11    0.064672
12    0.862444
13    0.483234
14    0.139678
15    0.863629
16    0.134514
17    0.761553
18    0.796703
19    0.935536
dtype: float64

Series sau khi chia 10 phân vị:
0     Decile_10
1      Decile_8
2      Decile_1
3      Decile_5
4      Decile_3
5      Decile_1
6      Decile_6
7      Decile_6
8      Decile_7
9      Decile_4
10     Decile_2
11     Decile_2
12     Decile_9
13     Decile_5
14     Decile_4
15     Decile_9
16     Decile_3
17     Decile_7
18     Decile_8
19    Decile_10
dtype: category
Categories (10, object): ['Decile_1' < 'Decile_2' < 'Decile_3' < 'Decile_4' ... 'Decile_7' < 'Decile_8' < 'Decile_9' < 'Decile_10']

4.9

In [10]:
import numpy as np
import pandas as pd

ser = pd.Series(np.random.randint(1, 10, 35))

df = pd.DataFrame(ser.values.reshape(7, 5))

print(df)

   0  1  2  3  4
0  7  2  9  9  1
1  1  6  3  6  1
2  8  8  9  2  7
3  8  5  3  9  1
4  5  9  8  7  7
5  3  2  2  9  1
6  1  7  9  4  5

4.10

In [11]:
import numpy as np
import pandas as pd

ser = pd.Series(np.random.randint(1, 10, 7))

positions = ser[ser % 3 == 0].index.tolist()

print("Series:")
print(ser)
print("\nVị trí các số là bội của 3:")
print(positions)

Series:
0    7
1    2
2    8
3    3
4    2
5    6
6    3
dtype: int32

Vị trí các số là bội của 3:
[3, 5, 6]

4.11

In [12]:
import pandas as pd

ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

result = ser.iloc[pos]

print(result)

0     a
4     e
8     i
14    o
20    u
dtype: object

4.12

In [13]:
import pandas as pd

ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

df = pd.concat([ser1, ser2], axis=1)
df.columns = ['number', 'letter']

print(df)

   number letter
0       0      a
1       1      b
2       2      c
3       3      d
4       4      e

4.13

In [14]:
import pandas as pd

ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

positions = [ser1[ser1 == x].index[0] for x in ser2]

print(positions)

[np.int64(5), np.int64(4), np.int64(0), np.int64(8)]

4.14

In [15]:
import numpy as np
import pandas as pd

truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

mse = ((truth - pred) ** 2).mean()

print("Mean Squared Error:", mse)

Mean Squared Error: 0.4434299990811345

4.15

In [16]:
import pandas as pd

ser = pd.Series(['how', 'to', 'kick', 'ass?'])

result = ser.str.capitalize()

print(result)

0     How
1      To
2    Kick
3    Ass?
dtype: object

4.16

In [17]:
import pandas as pd

ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

result = ser.diff().diff()

print(result)

0    NaN
1    NaN
2    1.0
3    1.0
4    1.0
5    1.0
6    0.0
7    2.0
dtype: float64

4.17

In [20]:
import pandas as pd

ser = pd.Series([
    '01 Jan 2010',
    '02-02-2011',
    '20120303',
    '2013/04/04',
    '2014-05-05',
    '2015-06-06T12:20'
])

# Chuyển sang timeseries (xử lý nhiều định dạng)
timeseries = pd.to_datetime(ser, format='mixed')

print(timeseries)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

4.18

In [21]:
import pandas as pd

emails = pd.Series([
    'buying books at amazom.com',
    'rameses@egypt.com',
    'matt@t.co',
    'narendra@modi.com'
])

pattern = r'[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Za-z]{2,4}'

# Trích xuất email hợp lệ
valid_emails = emails.str.findall(pattern)
valid_emails = valid_emails[valid_emails.str.len() > 0]

print(valid_emails)

1    [rameses@egypt.com]
2            [matt@t.co]
3    [narendra@modi.com]
dtype: object

4.19

In [22]:
import numpy as np
import pandas as pd

fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))

# Tính khối lượng trung bình theo từng loại quả
avg_weight = weights.groupby(fruit).mean()

print("Fruit:")
print(fruit.tolist())
print("Weights:")
print(weights.tolist())
print("\nKhối lượng trung bình từng loại quả:")
print(avg_weight)

Fruit:
['banana', 'banana', 'carrot', 'banana', 'carrot', 'carrot', 'carrot', 'banana', 'carrot', 'banana']
Weights:
[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]

Khối lượng trung bình từng loại quả:
banana    5.0
carrot    6.0
dtype: float64

4.20

In [34]:
import pandas as pd
import numpy as np

# --- TẠO DỮ LIỆU MẪU CHO EURO 2012 ---
euro12_data = {
    'Team': ['Italy', 'England', 'Russia', 'Germany', 'Greece', 'Spain', 'Portugal', 'France'],
    'Goals': [6, 5, 5, 10, 5, 12, 6, 3],
    'Shooting Accuracy': ['50.0%', '48.3%', '45.0%', '55.9%', '40.2%', '56.0%', '49.5%', '43.1%'],
    'Yellow Cards': [16, 9, 6, 4, 9, 11, 12, 6],
    'Red Cards': [0, 0, 1, 0, 1, 0, 0, 0],
    'Subs on': [18, 14, 10, 15, 12, 16, 14, 15],
    'Corners Taken': [30, 25, 20, 35, 15, 40, 32, 22]
}
pd.DataFrame(euro12_data).to_csv('euro12.csv', index=False)

# --- GIẢI BÀI 4.20 ---
# 1. Đọc dữ liệu và in thông tin cơ bản
euro12 = pd.read_csv('euro12.csv')
print(f"Type: {type(euro12)}")
print(f"Shape: {euro12.shape}")
print(f"Columns: {euro12.columns.tolist()}")

# 1 (Tiếp). In giá trị cột Goals
print("\n--- Cột Goals ---")
print(euro12['Goals'])

# 2. Số đội tham gia
print(f"\nSố đội tham gia: {euro12['Team'].nunique()}")

# 3. In thông tin
print("\n--- Thông tin Euro2012 ---")
euro12.info()

# 4. Tạo dataframe discipline
discipline = euro12[['Team', 'Yellow Cards', 'Red Cards']]

# 5. Sắp xếp discipline giảm dần
discipline_sorted = discipline.sort_values(['Red Cards', 'Yellow Cards'], ascending=False)
print("\n--- Discipline Sorted ---")
display(discipline_sorted)

# 6. a) Trung bình Yellow Cards; b) Đội > 6 bàn thắng
print(f"\nTrung bình Yellow Cards: {euro12['Yellow Cards'].mean()}")
teams_over_6 = euro12[euro12['Goals'] > 6]
print("\nĐội ghi hơn 6 bàn:")
print(teams_over_6['Team'].tolist())

# 7. Đội bắt đầu bằng 'G'
teams_G = euro12[euro12['Team'].str.startswith('G')]
print("\nĐội bắt đầu bằng 'G':", teams_G['Team'].tolist())

# 8. 7 cột đầu
print("\n--- 7 cột đầu ---")
display(euro12.iloc[:, :7])

# 9. Tất cả cột trừ 3 cột cuối
print("\n--- Bỏ 3 cột cuối ---")
display(euro12.iloc[:, :-3])

# 10. In các cột cụ thể
print("\n--- Cột Team, Goals, Accuracy, Cards ---")
display(euro12[['Team', 'Goals', 'Shooting Accuracy', 'Yellow Cards', 'Red Cards']])

# 11. Lọc England, Italy, Russia (chỉ Team và Accuracy)
filtered_teams = euro12[euro12['Team'].isin(['England', 'Italy', 'Russia'])][['Team', 'Shooting Accuracy']]
display(filtered_teams)

Type: <class 'pandas.core.frame.DataFrame'>
Shape: (8, 7)
Columns: ['Team', 'Goals', 'Shooting Accuracy', 'Yellow Cards', 'Red Cards', 'Subs on', 'Corners Taken']

--- Cột Goals ---
0     6
1     5
2     5
3    10
4     5
5    12
6     6
7     3
Name: Goals, dtype: int64

Số đội tham gia: 8

--- Thông tin Euro2012 ---
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Team               8 non-null      object
 1   Goals              8 non-null      int64
 2   Shooting Accuracy  8 non-null      object
 3   Yellow Cards       8 non-null      int64
 4   Red Cards          8 non-null      int64
 5   Subs on            8 non-null      int64
 6   Corners Taken      8 non-null      int64
dtypes: int64(5), object(2)
memory usage: 580.0+ bytes

--- Discipline Sorted ---

       Team  Yellow Cards  Red Cards
4    Greece             9          1
2    Russia             6          1
0     Italy            16          0
6  Portugal            12          0
5     Spain            11          0
1   England             9          0
7    France             6          0
3   Germany             4          0

Trung bình Yellow Cards: 9.125

Đội ghi hơn 6 bàn:
['Germany', 'Spain']

Đội bắt đầu bằng 'G': ['Germany', 'Greece']

--- 7 cột đầu ---

,Team,Goals,Shooting Accuracy,Yellow Cards,Red Cards,Subs on,Corners Taken
0,Italy,6,50.0%,16,0,18,30
1,England,5,48.3%,9,0,14,25
2,Russia,5,45.0%,6,1,10,20
3,Germany,10,55.9%,4,0,15,35
4,Greece,5,40.2%,9,1,12,15
5,Spain,12,56.0%,11,0,16,40
6,Portugal,6,49.5%,12,0,14,32
7,France,3,43.1%,6,0,15,22

--- Bỏ 3 cột cuối ---

       Team  Goals Shooting Accuracy  Yellow Cards
0     Italy      6             50.0%            16
1   England      5             48.3%             9
2    Russia      5             45.0%             6
3   Germany     10             55.9%             4
4    Greece      5             40.2%             9
5     Spain     12             56.0%            11
6  Portugal      6             49.5%            12
7    France      3             43.1%             6

--- Cột Team, Goals, Accuracy, Cards ---

       Team  Goals Shooting Accuracy  Yellow Cards  Red Cards
0     Italy      6             50.0%            16          0
1   England      5             48.3%             9          0
2    Russia      5             45.0%             6          1
3   Germany     10             55.9%             4          0
4    Greece      5             40.2%             9          1
5     Spain     12             56.0%            11          0
6  Portugal      6             49.5%            12          0
7    France      3             43.1%             6          0

      Team Shooting Accuracy
0    Italy             50.0%
1  England             48.3%
2   Russia             45.0%

4.21

In [35]:
import pandas as pd

# --- TẠO DỮ LIỆU MẪU CHO DRINKS ---
drinks_data = {
    'country': ['Vietnam', 'USA', 'France', 'Nigeria', 'Japan', 'Brazil', 'Germany', 'Australia'],
    'beer_servings': [300, 249, 127, 31, 77, 245, 346, 261],
    'spirit_servings': [100, 158, 151, 2, 202, 145, 117, 72],
    'wine_servings': [1, 84, 370, 1, 16, 16, 175, 212],
    'total_litres_of_pure_alcohol': [4.5, 8.7, 11.8, 0.5, 2.0, 7.2, 11.3, 10.4],
    'continent': ['AS', 'NA', 'EU', 'AF', 'AS', 'SA', 'EU', 'OC']
}
pd.DataFrame(drinks_data).to_csv('drinks.csv', index=False)

# --- GIẢI BÀI 4.21 ---
# 1. Đọc dữ liệu (index_col là cột đầu tiên 'country')
drink = pd.read_csv('drinks.csv', index_col=0)
print(f"Type: {type(drink)}, Shape: {drink.shape}")
print(f"Columns: {drink.columns.tolist()}")
print("\n--- 5 dòng đầu ---")
display(drink.head(5))

# 2. Số lượng bia trung bình mỗi châu lục
print("\n--- Bia trung bình theo Châu lục ---")
print(drink.groupby('continent')['beer_servings'].mean())

# 3. Thống kê wine theo châu lục
print("\n--- Thống kê Wine theo Châu lục ---")
display(drink.groupby('continent')['wine_servings'].describe())

# 4. Trung bình tất cả các loại bia/rượu theo châu lục
print("\n--- Mean bia/rượu theo Châu lục ---")
display(drink.groupby('continent').mean(numeric_only=True))

# 5. Trung vị (Median) theo châu lục
print("\n--- Median bia/rượu theo Châu lục ---")
display(drink.groupby('continent').median(numeric_only=True))

# 6. Spirit (Rượu mạnh): Mean, Max, Min theo châu lục
print("\n--- Spirit stats theo Châu lục ---")
display(drink.groupby('continent')['spirit_servings'].agg(['mean', 'max', 'min']))

# 7. Sắp xếp theo lượng bia tiêu thụ
drink_sorted = drink.sort_values('beer_servings')
print("\n--- 5 quốc gia tiêu thụ bia NHIỀU nhất ---")
display(drink_sorted.tail(5))
print("\n--- 5 quốc gia tiêu thụ bia ÍT nhất ---")
display(drink_sorted.head(5))

Type: <class 'pandas.core.frame.DataFrame'>, Shape: (8, 5)
Columns: ['beer_servings', 'spirit_servings', 'wine_servings', 'total_litres_of_pure_alcohol', 'continent']

--- 5 dòng đầu ---

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Vietnam,300,100,1,4.5,AS
USA,249,158,84,8.7,NaN
France,127,151,370,11.8,EU
Nigeria,31,2,1,0.5,AF
Japan,77,202,16,2.0,AS

--- Bia trung bình theo Châu lục ---
continent
AF     31.0
AS    188.5
EU    236.5
OC    261.0
SA    245.0
Name: beer_servings, dtype: float64

--- Thống kê Wine theo Châu lục ---

           count   mean         std    min     25%    50%     75%    max
continent
AF           1.0    1.0         NaN    1.0    1.00    1.0    1.00    1.0
AS           2.0    8.5   10.606602    1.0    4.75    8.5   12.25   16.0
EU           2.0  272.5  137.885822  175.0  223.75  272.5  321.25  370.0
OC           1.0  212.0         NaN  212.0  212.00  212.0  212.00  212.0
SA           1.0   16.0         NaN   16.0   16.00   16.0   16.00   16.0

--- Mean bia/rượu theo Châu lục ---

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,31.0,2.0,1.0,0.50
AS,188.5,151.0,8.5,3.25
EU,236.5,134.0,272.5,11.55
OC,261.0,72.0,212.0,10.40
SA,245.0,145.0,16.0,7.20

--- Median bia/rượu theo Châu lục ---

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,31.0,2.0,1.0,0.50
AS,188.5,151.0,8.5,3.25
EU,236.5,134.0,272.5,11.55
OC,261.0,72.0,212.0,10.40
SA,245.0,145.0,16.0,7.20

--- Spirit stats theo Châu lục ---

            mean  max  min
continent
AF           2.0    2    2
AS         151.0  202  100
EU         134.0  151  117
OC          72.0   72   72
SA         145.0  145  145

--- 5 quốc gia tiêu thụ bia NHIỀU nhất ---

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Brazil,245,145,16,7.2,SA
USA,249,158,84,8.7,NaN
Australia,261,72,212,10.4,OC
Vietnam,300,100,1,4.5,AS
Germany,346,117,175,11.3,EU

--- 5 quốc gia tiêu thụ bia ÍT nhất ---

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Nigeria,31,2,1,0.5,AF
Japan,77,202,16,2.0,AS
France,127,151,370,11.8,EU
Brazil,245,145,16,7.2,SA
USA,249,158,84,8.7,NaN

4.22

In [32]:
import pandas as pd
import numpy as np
import os

# --- BƯỚC TỰ TẠO DATA MẪU ---
if not os.path.exists('stocks1.csv'):
    stocks1_data = {
        'date': ['2023-01-01', '2023-01-01', '2023-01-02'],
        'symbol': ['AAPL', 'GOOGL', 'AAPL'],
        'open': [150.0, 2800.0, 155.0],
        'high': [160.0, np.nan, 158.0], # Có giá trị Null để làm ý 2
        'low': [148.0, 2780.0, np.nan],  # Có giá trị Null để làm ý 2
        'close': [158.0, 2810.0, 156.0],
        'volume': [1000000, 500000, 1100000]
    }
    pd.DataFrame(stocks1_data).to_csv('stocks1.csv', index=False)

if not os.path.exists('stocks2.csv'):
    stocks2_data = {
        'date': ['2023-01-03', '2023-01-03'],
        'symbol': ['AAPL', 'GOOGL'],
        'open': [156.0, 2815.0],
        'high': [162.0, 2830.0],
        'low': [155.0, 2805.0],
        'close': [160.0, 2825.0],
        'volume': [1200000, 600000]
    }
    pd.DataFrame(stocks2_data).to_csv('stocks2.csv', index=False)

if not os.path.exists('companies.csv'):
    comp_data = {
        'name': ['AAPL', 'GOOGL', 'MSFT'],
        'employees': [150000, 140000, 180000],
        'headquarters_city': ['Cupertino', 'Mountain View', 'Redmond'],
        'headquarters_state': ['CA', 'CA', 'WA']
    }
    pd.DataFrame(comp_data).to_csv('companies.csv', index=False)

# --- BẮT ĐẦU GIẢI BÀI 4.22 ---
# 1. Đọc dữ liệu
stocks1 = pd.read_csv('stocks1.csv')
stocks2 = pd.read_csv('stocks2.csv')
companies = pd.read_csv('companies.csv')

# 2. Xử lý Null theo quy tắc đề bài
stocks1['high'] = stocks1.groupby('symbol')['high'].transform(lambda x: x.fillna(x.max()))
stocks1['low'] = stocks1.groupby('symbol')['low'].transform(lambda x: x.fillna(x.min()))

# 3. Gộp stocks1 và stocks2
stocks = pd.concat([stocks1, stocks2], axis=0, ignore_index=True)

# 4. Gộp stocks và companies
stocks_companies = pd.merge(stocks, companies, left_on='symbol', right_on='name')

# 5 & 6. Thống kê
avg_per_company = stocks_companies.groupby('name')[['open', 'high', 'low', 'close', 'volume']].mean()
close_stats = stocks_companies.groupby('name')['close'].agg(['mean', 'max', 'min'])

# 7. Cột parsed_time
stocks_companies['parsed_time'] = pd.to_datetime(stocks_companies['date'])

# 8. Cột result
stocks_companies['result'] = np.where(stocks_companies['close'] > stocks_companies['open'], 'up', 'down')

print("--- Kết quả Bài 4.22 (5 dòng đầu) ---")
display(stocks_companies.head())

--- Kết quả Bài 4.22 (5 dòng đầu) ---

,date,symbol,open,high,low,close,volume,name,employees,headquarters_city,headquarters_state,parsed_time,result
0,2023-01-01,AAPL,150.0,160.0,148.0,158.0,1000000,AAPL,150000,Cupertino,CA,2023-01-01,up
1,2023-01-01,GOOGL,2800.0,NaN,2780.0,2810.0,500000,GOOGL,140000,Mountain View,CA,2023-01-01,up
2,2023-01-02,AAPL,155.0,158.0,148.0,156.0,1100000,AAPL,150000,Cupertino,CA,2023-01-02,up
3,2023-01-03,AAPL,156.0,162.0,155.0,160.0,1200000,AAPL,150000,Cupertino,CA,2023-01-03,up
4,2023-01-03,GOOGL,2815.0,2830.0,2805.0,2825.0,600000,GOOGL,140000,Mountain View,CA,2023-01-03,up

4.23

In [33]:
# --- TẠO DATA MẪU CHO MOVIELENS ---
movies_demo = {
    'movieId': [1, 2, 3],
    'title': ['Toy Story (1995)', 'Jumanji (1995)', 'Grumpier Old Men (1995)'],
    'genres': ['Adventure|Animation', 'Adventure|Children', 'Comedy|Romance']
}
ratings_demo = {
    'userId': [1, 1, 2, 2],
    'movieId': [1, 2, 1, 3],
    'rating': [4.0, 3.5, 5.0, 2.0],
    'timestamp': [964982703, 964981247, 964984002, 964984050]
}
pd.DataFrame(movies_demo).to_csv('movies.csv', index=False)
pd.DataFrame(ratings_demo).to_csv('ratings.csv', index=False)

# --- GIẢI BÀI 4.23 ---
# Đọc và Xử lý
df_movies = pd.read_csv('movies.csv')
df_ratings = pd.read_csv('ratings.csv')

# Gộp và Thống kê
movie_combined = pd.merge(df_movies, df_ratings, on='movieId')
movie_combined['date'] = pd.to_datetime(movie_combined['timestamp'], unit='s')

# Tính rating trung bình mỗi phim
top_movies = movie_combined.groupby('title')['rating'].mean().sort_values(ascending=False)

print("--- Kết quả Bài 4.23 (Rating trung bình) ---")
print(top_movies)
display(movie_combined.head())

--- Kết quả Bài 4.23 (Rating trung bình) ---
title
Toy Story (1995)           4.5
Jumanji (1995)             3.5
Grumpier Old Men (1995)    2.0
Name: rating, dtype: float64

,movieId,title,genres,userId,rating,timestamp,date
0,1,Toy Story (1995),Adventure|Animation,1,4.0,964982703,2000-07-30 18:45:03
1,1,Toy Story (1995),Adventure|Animation,2,5.0,964984002,2000-07-30 19:06:42
2,2,Jumanji (1995),Adventure|Children,1,3.5,964981247,2000-07-30 18:20:47
3,3,Grumpier Old Men (1995),Comedy|Romance,2,2.0,964984050,2000-07-30 19:07:30